[
  {
    "id": "1",
    "title": "CrowdStrike Statement on Bloomberg’s October 25, 2024 Story",
    "excerpt": "CrowdStrike menyatakan bahwa laporan Bloomberg tertanggal 25 Oktober 2024 menyesatkan dan menegaskan bahwa semua transaksi pembukuan telah sesuai dengan prinsip akuntansi yang berlaku.",
    "content": "<h3>Tanggapan CrowdStrike terhadap Laporan Bloomberg</h3><p>CrowdStrike meyakini bahwa laporan Bloomberg untuk berita tanggal 25 Oktober 2024 menyesatkan. CrowdStrike memiliki pesanan yang sah, ditandatangani, dan tidak dapat dibatalkan yang diajukan oleh Carahsoft di bawah perjanjian distribusinya.</p><p>CrowdStrike membukukan semua pesanan sesuai dengan Prinsip Akuntansi yang Diterima Secara Umum di AS (GAAP), dan kami mendukung akuntansi transaksi tersebut. Pernyataan bahwa CrowdStrike melakukan 'pre-booked' pada transaksi ini adalah salah.</p><blockquote>\"Kepercayaan, transparansi, dan integritas adalah inti dari budaya kami dan kami bangga menjalankan bisnis yang etis dan terhormat.\"</blockquote><p>Meskipun CrowdStrike telah memberikan fakta yang jelas, Bloomberg memilih untuk memprioritaskan tuduhan yang tidak akurat dari sumber yang tidak disebutkan namanya, yang kami yakini termasuk mantan karyawan yang tidak puas. Transaksi tersebut diperlakukan secara konsisten dengan definisi ARR (Annual Recurring Revenue) yang kami ungkapkan secara publik.</p>",
    "date": "18 Januari 2026",
    "category": "Security",
    "author": "Helga Alan Abhipraya",
    "image": "https://www.crowdstrike.com/content/dam/crowdstrike/www/en-us/wp/2024/07/Falcon-on-white.png",
    "tags": ["Security", "CrowdStrike", "Cybersecurity"]
  },
  {
    "id": "2",
    "title": "Fortinet Says SSL-VPN Pre-auth RCE Bug is Exploited in Attacks",
    "excerpt": "Fortinet memperingatkan pelanggan untuk segera melakukan patch pada perangkat mereka karena adanya kerentanan kritis SSL-VPN yang memungkinkan eksekusi kode jarak jauh tanpa autentikasi.",
    "content": "<h3>Kerentanan Kritis pada FortiOS SSL-VPN</h3><p>Fortinet telah merilis peringatan mengenai celah keamanan kritis yang dilacak sebagai CVE-2022-42475. Celah ini merupakan <i>heap-based buffer overflow</i> pada layanan sslvpnd di sistem operasi FortiOS yang secara aktif dieksploitasi oleh penyerang di dunia nyata.</p><p>Eksploitasi yang berhasil memungkinkan penyerang jarak jauh yang tidak terautentikasi untuk mengeksekusi kode atau perintah arbitrer melalui permintaan yang dirancang khusus, atau menyebabkan perangkat mengalami <i>crash</i>.</p><blockquote>\"Celah keamanan ini sangat serius karena memungkinkan akses tanpa perlu login terlebih dahulu ke perangkat yang terdampak.\"</blockquote><p>Fortinet telah merilis daftar indikator kompromi (IOC) dan menyarankan administrator sistem untuk memeriksa log mereka guna mencari entri seperti <i>'Application crashed'</i> yang terkait dengan <i>sslvpnd</i>. Pengguna sangat disarankan untuk memperbarui perangkat mereka ke versi FortiOS terbaru guna memitigasi risiko ini.</p>",
    "date": "18 Januari 2026",
    "category": "Security",
    "author": "Helga Alan Abhipraya",
    "image": "https://www.bleepstatic.com/content/hl-images/2022/10/14/Fortinet.jpg",
    "tags": ["Vulnerability", "Fortinet", "SSL-VPN"]
  },
  {
    "id": "3",
    "title": "Cloudflare Patches Critical Zero-Day Vulnerability in ACME Validation Logic",
    "excerpt": "Cloudflare baru saja menambal celah keamanan kritis pada logika validasi ACME yang memungkinkan penyerang melewati kontrol keamanan WAF dan mengakses server asal secara langsung.",
    "content": "<h3>Detail Kerentanan ACME Cloudflare</h3><p>Cloudflare telah memperbaiki kerentanan serius dalam sistem otomatisasi sertifikat mereka, khususnya pada logika validasi ACME (Automatic Certificate Management Environment). Celah ini berakar pada bagaimana jaringan edge Cloudflare memproses permintaan yang ditujukan untuk jalur tantangan <i>ACME HTTP-01</i> (<code>/.well-known/acme-challenge/*</code>).</p><p>Kerentanan ini memungkinkan penyerang jarak jauh yang tidak terautentikasi untuk melewati perlindungan Web Application Firewall (WAF) dan fitur keamanan lainnya. Dalam skenario tertentu, penyerang dapat memanipulasi permintaan untuk mendapatkan akses langsung ke server asal (origin server) pelanggan, yang seharusnya terlindungi di balik infrastruktur Cloudflare.</p><blockquote>\"Celah ini ditemukan melalui program Bug Bounty dan telah dimitigasi sepenuhnya. Hingga saat ini, tidak ada bukti bahwa kerentanan ini telah dieksploitasi oleh aktor jahat di dunia nyata.\"</blockquote><p>Investigasi menunjukkan bahwa masalah ini terjadi karena adanya kesalahan konfigurasi pada sistem pemrosesan permintaan di tingkat edge yang memberikan pengecualian keamanan terlalu luas pada jalur validasi sertifikat. Cloudflare telah menerapkan pembaruan sistem secara global untuk memastikan semua permintaan melalui pemeriksaan keamanan yang ketat tanpa mengganggu proses pembaruan sertifikat otomatis.</p>",
    "date": "23 Januari 2026",
    "category": "Security",
    "author": "Helga Alan Abhipraya",
    "image": "https://blogger.googleusercontent.com/img/b/R29vZ2xl/AVvXsEiklvHynWev7KGK969jOFlu6a0M_M7n9fU6J_NjTLKdkbdTKb2k1eLELGV20pGgHPnezhBmDFCJz4VaHHCmxmVIpOIewXbfwW8oNBI5u_ovDNNiLVmgKAjTv8PvcX4syPC7NzZQLsk3xBtcXDNXEdEC75WzPm00s9Yc_LuUhpYQipVlew2ISI5HM-bGQue6/s16000/Cloudflare%20Zero-Day%20Vulnerability.webp"
  }
]